/* 
  File.strings
  BetterAndBetter

  Created by SG on 2020/5/21.
  Copyright © 2020 SG. All rights reserved.
*/

"Zoom" = "缩放";
"Successed" = "成功";
"Upload time" = "上传时间";
"All Applications" = "所有应用程序";
"Select app from running apps" = "运行中的程序选取";
"Select app from file system" = "系统文件里选取";
"Select Path from file system" = "系统文件里选取";
"Manual input or paste" = "手工输入或粘贴";
"Shortcut Keys:  " = "快捷键:  ";
"BetterAndBetter Preferences" = "BetterAndBetter 偏好设置";
"Restart BetterAndBetter" = "重启 BetterAndBetter";
"Exit BetterAndBetter" = "退出 BetterAndBetter";
"Click to Select" = "点击选择";
"Click to Edit" = "点击修改";
"iCloud has backed up" = "iCloud已备份";
"iCloud is not backed up" = "iCloud未备份";
"Using" = "使用中";
"Unused" = "未使用";
"Default" = "默认";
"All setting parameters will be reseted!" = "所有的设置参数将被重置！";
"OK" = "确定";
"Cancel" = "取消";
"Open..." = "打开 App,文件(夹),网址...";
"Application" = "程序";
"Website" = "网址";
"File Folder" = "文件夹";
"File" = "文件";
"Disable" = "未使用";
"Quit" = "退出";
"Agree" = "同意";
"Uploading" = "上传中";
"Downloading" = "下载中";
"Video" = "视频";
"LeftMouseDown" = "左键按下";
"LeftMouseUp" = "左键松开";
"RightMouseDown" = "右键按下";
"RightMouseUp" = "右键松开";
"MiddleMouseDown" = "中键按下";
"MiddleMouseUp" = "中键松开";
"ScrollUp" = "向上滚轮";
"ScrollDown" = "向下滚轮";
"ScrollLeft" = "向左滚轮";
"ScrollRight" = "向右滚轮";
"4 KeyDown" = "四键按下";
"4 KeyUp" = "四键松开";
"5 KeyDown" = "五键按下";
"5 KeyUp" = "五键松开";
"6 KeyDown" = "六键按下";
"6 KeyUp" = "六键松开";
"7 KeyDown" = "七键按下";
"7 KeyUp" = "七键松开";
"8 KeyDown" = "八键按下";
"8 KeyUp" = "八键松开";

"Please enter the system password!" = "请输入系统密码!";
"" = "";

"Select " = "选择";
"RightMouse" = "右键";
"MiddleMouse" = "中键";
" Blacklist Apps" = "黑名单Apps";
"Palm" = "手掌";
"Holding " = "按住";
"Scroll Up" = "滚轮向上";
"Scroll Down" = "滚轮向下";
"Scroll Left" = "滚轮向左";
"Scroll Right" = "滚轮向右";
"Click" = "点击";
"LeftMouse Click" = "左键点击";
"RightMouse Click" = "右键点击";
"MiddleMouse Click" = "中键点击";

"LeftMouse Down" = "左键按下";
"RightMouse Down" = "右键按下";
"MiddleMouse Down" = "中键按下";

"MiddleMouse Down" = "中键按下";
"MiddleMouse Up" = "中键松开";

"LeftMouse Up" = "左键抬起";
"RightMouse Up" = "右键抬起";
"MiddleMouse Up" = "中键抬起";

"4Key Click" = "四键点击";
"5Key Click" = "五键点击";
"6Key Click" = "六键点击";
"7Key Click" = "七键点击";
"8Key Click" = "八键点击";
"4Key" = "四键";
"5Key" = "五键";
"6Key" = "六键";
"7Key" = "七键";
"8Key" = "八键";

"disable Wi-Fi" = "断开WI-FI";
"enable Wi-Fi" = "连接WI-FI";
"Open WeChat.app" = "打开微信";
"Open QQ.app" = "打开QQ";
"Quit QQ.app" = "退出QQ";
"Hidden All Files On Desktop" = "隐藏桌面文件";
"Nohidden All Files On Desktop" = "显示桌面文件";
"Activate WeChat.app" = "激活微信";
"Open the specified link" = "打开指定的链接";
"Hidden/unHidden QQ application" = "隐藏/显示 QQ程序";
"Empty the trash" = "清倒废纸篓";
"New AppleScript" = "新建脚本";

"BAB provides strong support for the iRightMouse on the App Store, which can make the iRightMouse more convenient and powerful. In the future, you can also add more functions that are prohibited by the sandbox. Please provide valuable suggestions." = "\nBAB为App Store上的超级右键提供强力支撑，可以使超级右键更加方便，强大，以后也可以增加更多沙盒禁止的功能，请提供宝贵建议，谢谢。";

"\nPress and hold the Fn key, a finger moves on the touchpad, and a moving track will be drawn on the screen. Based on the comparison of this track and the set track, the matching will perform the corresponding action" = "\n\n按住Fn键，单指在触摸板上移动，会在屏幕上绘制移动的轨迹。 根据此轨迹和规则里轨迹做比较，匹配上将执行设置的动作。";

"\n\nThe thumb touches the bottom edge of the touchpad, and then draws on the touchpad with another finger." = "\n\n拇指接触触摸板底边，然后用另一个手指在触摸板上绘图。\n\n\n详见视频:";

"\nThree fingers touch the Magic Mouse, press, drag and release, BAB will simulate the middle button press, drag and release." = "\n三个手指接触妙控鼠标，按下，拖移和松开，BAB会模拟中键的按下，拖移和松开。\n\n\n详见视频:";

"\nIt triggers the rules of rightmouse drawing and middlemouse drawing settings in the normal mouse module, and the tracking speed set in the normal mouse is also effective for the magic mouse." = "\n\n触发的是普通鼠标模块里右键绘图、中键绘图设置的规则，在普通鼠标设置的跟踪速度对妙控鼠标也有效。";

"1.The tracking speed set here is the same as that in the system, but it can be set faster than the system, which is also effective for the magic mouse.\n2.When the tracking speed is zero, the system setting shall prevail.\n3.Close acceleration is a linear relationship between mouse movement and cursor movement." = "\n1，这里设置的跟踪速度与系统中的跟踪速度设置相同，但是可以设置比系统更快的速度，对于妙控鼠标一样有效。\n2，跟踪速度为0时以系统设置为准。\n3，关闭加速度就是鼠标移动和光标移动成线形关系。";

"BetterAndBetter needs privacy authorization in the auxiliary function. \nIf it has been authorized, this window still pops up, please check again and restart the computer." = "     BetterAndBetter需要辅助功能里隐私授权。\n如果已经授权，还是弹出这个窗口，请重新勾选后重启电脑。";

"Blacklist" = "黑名单";
"Default" = "默认";
"Sleep" = "休眠";
"BackSpace" = "退格";
"ScrollUp" = "滚轮向上";
"ScrollDown" = "滚轮向下";

"Holding one second" = "按住一秒";
"Single finger drawing" = "单指绘图";
"1Finger_Tap" = "单指轻点";
"1Finger_Click" = "单指点按";
"1Finger_Tap_Top_Left" = "单指左上角轻点";
"1Finger_Tap_Top_Right" = "单指右上角轻点";
"1Finger_Tap_Bottom_Left" = "单指左下角轻点";
"1Finger_Tap_Bottom_Right" = "单指右下角轻点";
"1Finger_Tap_Top_Middle" = "单指上中边轻点";
"1Finger_Tap_Right_Middle" = "单指右中边轻点";
"1Finger_Tap_Bottom_Middle" = "单指下中边轻点";
"1Finger_Tap_Left_Middle" = "单指左中边轻点";

"1Finger_Click_Top_Left" = "单指左上角点按";
"1Finger_Click_Top_Right" = "单指右上角点按";
"1Finger_Click_Bottom_Left" = "单指左下角点按";
"1Finger_Click_Bottom_Right" = "单指右下角点按";
"1Finger_Click_Top_Middle" = "单指上中边点按";
"1Finger_Click_Right_Middle" = "单指右中边点按";
"1Finger_Click_Bottom_Middle" = "单指下中边点按";
"1Finger_Click_Left_Middle" = "单指左中边点按";

"1Finger_Tap_Left" = "单指左侧轻点";
"1Finger_Tap_Middle " = "单指中间轻点"; //多了一空格,和触摸板做区别,那里翻译成中心轻点
"1Finger_Tap_Right" = "单指右侧轻点";
"1Finger_Click_Middle" = "单指中间点击";

"1Finger_Tap_Center" = "单指中心轻点";
"1Finger_Tap_Middle" = "单指中心轻点";
"2Finger_Click" = "二指点按";
"2Finger_Tap" = "二指轻点";
"2Finger_TipTap_Right" = "二指，右指轻点";
"2Finger_TipTap_Left" = "二指，左指轻点";
"2Finger_Swipe_Up" = "二指上滑";
"2Finger_Swipe_Down" = "二指下滑";
"2Finger_Swipe_Left" = "二指左滑";
"2Finger_Swipe_Right" = "二指右滑";
"2Finger_TipTap_Near_Left" = "二指，左指近拍";
"2Finger_TipTap_Far_Left" = "二指，左指远拍";
"2Finger_TipTap_Near_Right" = "二指，右指近拍";
"2Finger_TipTap_Far_Right" = "二指，右指远拍";
"2Finger_Swipe_Up_From Bottom" = "二指底部滑入";
"2Finger_Swipe_Down_From Top" = "二指顶部滑入";
"2Finger_Swipe_Right_From Left" = "二指左侧滑入";
"2Finger_Swipe_Left_From Right" = "二指右侧滑入";
"2Finger_Pinch_In" = "二指捏合";
"2Finger_Pinch_Out" = "二指张开";
"2Finger_LeftFinger_SwipeLeft" = "二指，左指左滑";
"2Finger_LeftFinger_SwipeRight" = "二指，左指右滑";
"2Finger_RightFinger_SwipeLeft" = "二指，右指左滑";
"2Finger_RightFinger_SwipeRight" = "二指，右指右滑";
"3Finger_Click" = "三指点按";
"3Finger_Tap" = "三指轻点";
"3Finger_TipTap_Middle" = "三指，中指轻点";
"3Finger_TipTap_Left" = "三指，左指轻点";
"3Finger_TipTap_Right" = "三指，右指轻点";
"3Finger_Swipe_Left" = "三指左滑";
"3Finger_Swipe_Right" = "三指右滑";
"3Finger_Swipe_Down" = "三指下滑";
"3Finger_Swipe_Up" = "三指上滑";
"3Finger_Pinch_In" = "三指合拢";
"3Finger_Pinch_Out" = "三指张开";
"3Finger_LeftFinger_SwipeLeft" = "三指，左指左滑";
"3Finger_LeftFinger_SwipeRight" = "三指，左指右滑";
"3Finger_LeftFinger_SwipeUp" = "三指，左指上滑";
"3Finger_LeftFinger_SwipeDown" = "三指，左指下滑";
"4Finger_Click" = "四指点按";
"4Finger_Tap" = "四指轻点";
"4Finger_Swipe_Left" = "四指左滑";
"4Finger_Swipe_Right" = "四指右滑";
"4Finger_Swipe_Down" = "四指下滑";
"4Finger_Swipe_Up" = "四指上滑";
"4Finger_Pinch_In" = "四指合拢";
"4Finger_Pinch_Out" = "四指张开";
"4Finger_LeftFinger_SwipeLeft" = "四指，左指左滑";
"4Finger_LeftFinger_SwipeRight" = "四指，左指右滑";
"4Finger_TipTap_Left" = "四指，左指轻点";
"4Finger_TipTap_Right" = "四指，右指轻点";
"5Finger_Tap" = "五指轻点";
"5Finger_Click" = "五指点按";
"5Finger_Swipe_Left" = "五指左滑";
"5Finger_Swipe_Right" = "五指右滑";
"5Finger_Swipe_Down" = "五指下滑";
"5Finger_Swipe_Up" = "五指上滑";
"1Finger_DoubleTap" = "单指双拍";
"2Finger_DoubleTap" = "二指双拍";
"3Finger_DoubleTap" = "三指双拍";
"4Finger_DoubleTap" = "四指双拍";
"5Finger_DoubleTap" = "五指双拍";

"1Finger_ForceClick" = "单指用力点按";
"2Finger_ForceClick" = "二指用力点按";
"3Finger_ForceClick" = "三指用力点按";
"4Finger_ForceClick" = "四指用力点按";
"5Finger_ForceClick" = "五指用力点按";

"Two Fingers Drawing" = "双指绘图";


"VolumeUp" = "增加音量";
"VolumeDown" = "减少音量";
"VolumeMute" = "静音";
"BrightnessUp" = "增加亮度";
"BrightnessDown" = "减少亮度";

"Previous Track" = "上一首";
"Play/Pause" = "播放/暂停";
"Next Track" = "下一首";
"External Screen BrightnessUp" = "外接屏幕增加亮度";
"External Screen BrightnessDown" = "外接屏幕减少亮度";
"Move Window To Next Space" = "移动窗口到下一桌面";
"Move Window To Pre Space" = "移动窗口到上一桌面";
"Input PassWord" = "输入系统密码";
"Minimization" = "最小化";
"All Minimization" = "全部窗口最小化";
"Minimization All Recovery" = "全部窗口恢复最小化";
"Minimization Recovery" = "恢复最小化";
"LeftMouseClick" = "左键点击";
"MiddleMouseClick" = "中键点击";
"RightMouseClick" = "右键点击";
"⌘+Click" = "⌘+点击";
"⇧+⌘+Click" = "⇧+⌘+点击";
"Custom Window" = "自定义窗口";
"Maximization" = "最大化";
"Max of Height" = "高度最大化";
"Max of Width" = "宽度最大化";
//"Set FirstWindow To Default Data" = "设置自定义窗口数据";
//"Recover FirstWindow From Default Data" = "恢复成自定义窗口数据";
"User-Defined Window" = "自定义窗口";
"User-Defined Window ..." = "自定义窗口 ...";
"Restore the previous position" = "恢复窗口前一个位置";
"Previous Window" = "前一个窗口";
"Previous Application" = "前一个程序";
"Quarte_of_Top_Right" = "1/4右上角";
"Quarte_of_Top_Left" = "1/4左上角";
"Quarte_of_Bottom_Right" = "1/4右下角";
"Quarte_of_Bottom_Left" = "1/4左下角";
"Half_of_Top" = "1/2上分屏";
"Half_of_Bottom" = "1/2下分屏";
"Half_of_Right" = "1/2右分屏";
"half_of_Left" = "1/2左分屏";
"Move Window To Pre Screen" = "移窗口到上一个屏幕";
"Move Window To Next Screen" = "移窗口到下一个屏幕";
"Center" = "居中";
"Chinese/English IM Conversion" = "中/英 输入法切换";
"LockScreen" = "锁屏";
"ScreenSaver" = "屏幕保护";
"FullScreen" = "进入全屏幕";
"Enter Full Screen" = "进入全屏幕";
"Exit Full Screen" = "退出全屏幕";
"Exit FullScreen" = "退出全屏幕";
"hide/nohidden menubar icon" = "隐藏/显示菜单栏图标";
"Hidden All Selected" = "隐藏所选文件";
"Nohidden All Selected" = "显示所选文件";

"DarkMode" = "黑暗模式";
"LightMode" = "亮色模式";

"Position" = "位置";
"Size" = "尺寸";
"Screen Width" = "屏幕宽度";
"Screen Height" = "屏幕高度";

"Close Tab" = "关闭标签页";
"Quit Application" = "退出程序";
"Next Tab" = "下一个标签页";
"Zoom" = "缩放";
"Next Window" = "下一个窗口";
"Prev Space" = "上一个桌面";
"Next Space" = "下一个桌面";
"Open at new tab" = "在新标签页打开";
"Prev Tab" = "上一个标签页";
"Refresh" = "刷新";

"Select ALL" = "选择全部";
"Paste" = "粘贴";
"PageDown" = "向下翻页";
"PageUp" = "向上翻页";

"Turn On BlueTooth" = "打开蓝牙";
"Turn Off BlueTooth" = "关闭蓝牙";
"Turn On WIFI" = "打开WIFI";
"Turn Off WIFI" = "关闭WIFI";

"Min KeyBoard Brightness" = "关闭键盘灯";
"Middle KeyBoard Brightness" = "50%键盘灯";
"Max KeyBoard Brightness" = "最亮键盘灯";

"Hide All Apps Except Finder" = "隐藏除访达所有程序";
"Unhide All Applications" = "显示所有程序";

"\n\n1.The mouse key without drawing rules will not trigger the drawing function.\n\n2.The drawing will be displayed when the BAB preference window is activated" = "\n\n1，没有设置绘图规则的鼠标按键不会触发绘图功能。\n\n2，BAB偏好设置窗口激活时除了左键都会显示绘图轨迹。";

"If you need encryption, please enter the password." = "如果需要加密请输入密码。";

"Edit in External Editor" = "在脚本编辑器编辑";
"Finish Editing" = "完成编辑";

"\nIt is detected that the BetterAndBetter daemon is not started and cannot run normally. Please click the \"Check\" button below to solve this problem." = "\n检测到BetterAndBetter守护进程未启动，无法正常运行，请点击下面“检查”按钮，解决此问题。";
"In order to run more stably, BAB must be installed in the application of the system.\nthe correct path is /Applications/BetterAndBetter.app\nthe current installation path:" = "为了更加稳定运行，BAB务必安装在系统的应用程序里。\n正确路径：/Applications/BetterAndBetter.app\n当前安装路径：";
"Warning" = "警告";

"Download" = "下载";

"Check" = "检查";

"LeftMouse Click at TopLeft Corner" = "左上角左键点击";
"LeftMouse Click at TopLeft Side" = "上左边左键点击";
"LeftMouse Click at TopMiddle Side" = "上中边左键点击";
"LeftMouse Click at TopRight Side" = "上右边左键点击";

"LeftMouse Click at RightTop Side" = "右上边左键点击";
"LeftMouse Click at RightMiddle Side" = "右中边左键点击";
"LeftMouse Click at RightBottom Side" = "右下边左键点击";
"LeftMouse Click at LeftTop Side" = "左上边左键点击";
"LeftMouse Click at LeftMiddle Side" = "左中边左键点击";
"LeftMouse Click at LeftBottom Side" = "左下边左键点击";

"RightMouse Click at TopLeft Corner" = "左上角右键点击";
"RightMouse Click at TopLeft Side" = "上左边右键点击";
"RightMouse Click at TopMiddle Side" = "上中边右键点击";
"RightMouse Click at TopRight Side" = "上右边右键点击";

"RightMouse Click at RightTop Side" = "右上边右键点击";
"RightMouse Click at RightMiddle Side" = "右中边右键点击";
"RightMouse Click at RightBottom Side" = "右下边右键点击";
"RightMouse Click at LeftTop Side" = "左上边右键点击";
"RightMouse Click at LeftMiddle Side" = "左中边右键点击";
"RightMouse Click at LeftBottom Side" = "左下边右键点击";

"MiddleMouse Click at TopLeft Corner" = "左上角中键点击";
"MiddleMouse Click at TopLeft Side" = "上左边中键点击";
"MiddleMouse Click at TopMiddle Side" = "上中边中键点击";
"MiddleMouse Click at TopRight Side" = "上右边中键点击";

"MiddleMouse Click at RightTop Side" = "右上边中键点击";
"MiddleMouse Click at RightMiddle Side" = "右中边中键点击";
"MiddleMouse Click at RightBottom Side" = "右下边中键点击";
"MiddleMouse Click at LeftTop Side" = "左上边中键点击";
"MiddleMouse Click at LeftMiddle Side" = "左中边中键点击";
"MiddleMouse Click at LeftBottom Side" = "左下边中键点击";

"Scroll Up at TopLeft Corner" = "左上角滚轮向上";
"Scroll Up at TopLeft Side" = "上左边滚轮向上";
"Scroll Up at TopMiddle Side" = "上中边滚轮向上";
"Scroll Up at TopRight Side" = "上右边滚轮向上";

"Scroll Up at RightTop Side" = "右上边滚轮向上";
"Scroll Up at RightMiddle Side" = "右中边滚轮向上";
"Scroll Up at RightBottom Side" = "右下边滚轮向上";
"Scroll Up at LeftTop Side" = "左上边滚轮向上";
"Scroll Up at LeftMiddle Side" = "左中边滚轮向上";
"Scroll Up at LeftBottom Side" = "左下边滚轮向上";

"Scroll Down at TopLeft Corner" = "左上角滚轮向下";
"Scroll Down at TopLeft Side" = "上左边滚轮向下";
"Scroll Down at TopMiddle Side" = "上中边滚轮向下";
"Scroll Down at TopRight Side" = "上右边滚轮向下";

"Scroll Down at RightTop Side" = "右上边滚轮向下";
"Scroll Down at RightMiddle Side" = "右中边滚轮向下";
"Scroll Down at RightBottom Side" = "右下边滚轮向下";
"Scroll Down at LeftTop Side" = "左上边滚轮向下";
"Scroll Down at LeftMiddle Side" = "左中边滚轮向下";
"Scroll Down at LeftBottom Side" = "左下边滚轮向下";

"LeftMouse Click at TopRight Corner" = "右上角左键点击";
"RightMouse Click at TopRight Corner" = "右上角右键点击";
"MiddleMouse Click at TopRight Corner" = "右上角中键点击";
"Scroll Up at TopRight Corner" = "右上角滚轮向上";
"Scroll Down at TopRight Corner" = "右上角滚轮向下";

"LeftMouse Click at BottomLeft Corner" = "左下角左键点击";
"RightMouse Click at BottomLeft Corner" = "左下角右键点击";
"MiddleMouse Click at BottomLeft Corner" = "左下角中键点击";
"Scroll Up at BottomLeft Corner" = "左下角滚轮向上";
"Scroll Down at BottomLeft Corner" = "左下角滚轮向下";

"LeftMouse Click at BottomRight Corner" = "右下角左键点击";
"LeftMouse Click at BottomLeft Side" = "下左边左键点击";
"LeftMouse Click at BottomMiddle Side" = "下中边左键点击";
"LeftMouse Click at BottomRight Side" = "下右边左键点击";

"RightMouse Click at BottomRight Corner" = "右下角右键点击";
"RightMouse Click at BottomLeft Side" = "下左边右键点击";
"RightMouse Click at BottomMiddle Side" = "下中边右键点击";
"RightMouse Click at BottomRight Side" = "下右边右键点击";

"MiddleMouse Click at BottomRight Corner" = "右下角中键点击";
"MiddleMouse Click at BottomLeft Side" = "下左边中键点击";
"MiddleMouse Click at BottomMiddle Side" = "下中边中键点击";
"MiddleMouse Click at BottomRight Side" = "下右边中键点击";

"Scroll Up at BottomRight Corner" = "右下角滚轮向上";
"Scroll Up at BottomLeft Side" = "下左边滚轮向上";
"Scroll Up at BottomMiddle Side" = "下中边滚轮向上";
"Scroll Up at BottomRight Side" = "下右边滚轮向上";

"Scroll Down at BottomRight Corner" = "右下角滚轮向下";
"Scroll Down at BottomLeft Side" = "下左边滚轮向下";
"Scroll Down at BottomMiddle Side" = "下中边滚轮向下";
"Scroll Down at BottomRight Side" = "下右边滚轮向下";



